#!/bin/bash

# 再ビルド
make re

# 手動テスト
# echo "------ 手動引数テスト ------"
# ./PmergeMe 5 3 4 2 1
# echo "--------------------------------"

# # 手動テスト
# echo "------ 手動引数テスト ------"
# ./PmergeMe 3 5 9 7 4 2 6 8 1
# echo "--------------------------------"


echo "------ 手動引数テスト ------"
./PmergeMe 21 1 13 2 17 3 12 4 20 5 15 6 19 7 14 8 18 9 16 10 11
echo "--------------------------------"
# ランダムテスト
# echo "------ ランダムテスト (1～10000の数字100個) ------"
# RANDOM_NUMS=$(for i in {1..3000}; do echo -n "$((RANDOM % 10000 + 1)) "; done)
# ./PmergeMe $RANDOM_NUMS
